apache/nuttx/arch/arm/include/samd2l2/chip.h
#elif defined(CONFIG_ARCH_CHIP_SAMD20G14)

#  define SAMD20                    1             /* SAMD20 family */
#  undef  SAMD20E
#  define SAMD20G                   1             /* SAMD20G */
#  undef  SAMD20J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (16*1024)     /* 16KB */
#  define SAMD2L2_SRAM0_SIZE        (2*1024)      /*  2KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD20G15)

#  define SAMD20                    1             /* SAMD20 family */
#  undef  SAMD20E
#  define SAMD20G                   1             /* SAMD20G */
#  undef  SAMD20J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (32*1024)     /* 32KB */
#  define SAMD2L2_SRAM0_SIZE        (4*1024)      /*  4KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD20G16)

#  define SAMD20                    1             /* SAMD20 family */
#  undef  SAMD20E
#  define SAMD20G                   1             /* SAMD20G */
#  undef  SAMD20J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (64*1024)     /* 64KB */
#  define SAMD2L2_SRAM0_SIZE        (8*1024)      /*  8KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD20G17)

#  define SAMD20                    1             /* SAMD20 family */
#  undef  SAMD20E
#  define SAMD20G                   1             /* SAMD20G */
#  undef  SAMD20J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (128*1024)    /* 128KB */
#  define SAMD2L2_SRAM0_SIZE        (16*1024)     /*  16KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD20G18)

#  define SAMD20                    1             /* SAMD20 family */
#  undef  SAMD20E
#  define SAMD20G                   1             /* SAMD20G */
#  undef  SAMD20J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (256*1024)    /* 256KB */
#  define SAMD2L2_SRAM0_SIZE        (32*1024)     /*  32KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD20J14)

#  define SAMD20                    1             /* SAMD20 family */
#  undef  SAMD20E
#  undef  SAMD20G
#  define SAMD20J                   1             /* SAMD20J */

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (16*1024)     /* 16KB */
#  define SAMD2L2_SRAM0_SIZE        (2*1024)      /*  2KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD20J15)

#  define SAMD20                    1             /* SAMD20 family */
#  undef  SAMD20E
#  undef  SAMD20G
#  define SAMD20J                   1             /* SAMD20J */

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (32*1024)     /* 32KB */
#  define SAMD2L2_SRAM0_SIZE        (4*1024)      /*  4KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD20J16)

#  define SAMD20                    1             /* SAMD20 family */
#  undef  SAMD20E
#  undef  SAMD20G
#  define SAMD20J                   1             /* SAMD20J */

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (64*1024)     /* 64KB */
#  define SAMD2L2_SRAM0_SIZE        (8*1024)      /*  8KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD20J17)

#  define SAMD20                    1             /* SAMD20 family */
#  undef  SAMD20E
#  undef  SAMD20G
#  define SAMD20J                   1             /* SAMD20J */

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (128*1024)    /* 128KB */
#  define SAMD2L2_SRAM0_SIZE        (16*1024)     /*  16KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD20J18)

#  define SAMD20                    1             /* SAMD20 family */
#  undef  SAMD20E
#  undef  SAMD20G
#  define SAMD20J                   1             /* SAMD20J */

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (256*1024)    /* 256KB */
#  define SAMD2L2_SRAM0_SIZE        (32*1024)     /*  32KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#else

#  undef  SAMD20                                  /* Not SAMD20 family */
#  undef  SAMD20E
#  undef  SAMD20G
#  undef  SAMD20J

#endif

/* SAMD20 Peripherals */

#if defined(SAMD20E)
#  define SAMD2L2_NEVENTS           8             /* 8 event channels */
#  define SAMD2L2_NTC               6             /* 6 Timer/counters */
#  define SAMD2L2_NTCOUT            2             /* 2 TC output channels */
#  define SAMD2L2_NTCC              0             /* No TC control channels */
#  define SAMD2L2_NTCCOUT           0             /* No TCC output channels */
#  define SAMD2L2_NDMACHAN          0             /* No DMA channels */
#  define SAMD2L2_NUSBIF            0             /* No USB interface */
#  define SAMD2L2_NAES              0             /* No AES engine */
#  define SAMD2L2_NCCL              0             /* No Counfigurable Custom Logic */
#  define SAMD2L2_NTRNG             0             /* No True random number generator */
#  define SAMD2L2_NSERCOM           4             /* 4 SERCOM */
#  define SAMD2L2_NI2S              0             /* No I2S */
#  define SAMD2L2_NADC              10            /* 10 ADC channels */
#  define SAMD2L2_NCMP              2             /* 2 Comparators */
#  define SAMD2L2_NDAC              1             /* 1 DAC channel */
#  define SAMD2L2_NOPAMP            0             /* No OpAmps */
#  define SAMD2L2_RTC               1             /* Have RTC */
#  define SAMD2L2_NALARMS           1             /* 1 RTC alarm */
#  define SAMD2L2_NRTCMP            1             /* RTC compare: 1 32-bit/2 16-bit */
#  define SAMD2L2_NEXTINT           16            /* 16 External interrupts */
#  define SAMD2L2_NPTCX             10            /* PTC X */
#  define SAMD2L2_NPTCY             6             /* PTC Y */
#  define SAMD2L2_WDT               1             /* Have watchdog timer */
#elif defined(SAMD20G)
#  define SAMD2L2_NEVENTS           8             /* 8 event channels */
#  define SAMD2L2_NTC               6             /* 6 Timer/counters */
#  define SAMD2L2_NTCOUT            2             /* 2 TC output channels */
#  define SAMD2L2_NTCC              0             /* No TC control channels */
#  define SAMD2L2_NTCCOUT           0             /* No TCC output channels */
#  define SAMD2L2_NDMACHAN          0             /* No DMA channels */
#  define SAMD2L2_NUSBIF            0             /* No USB interface */
#  define SAMD2L2_NAES              0             /* No AES engine */
#  define SAMD2L2_NCCL              0             /* No Counfigurable Custom Logic */
#  define SAMD2L2_NTRNG             0             /* No True random number generator */
#  define SAMD2L2_NSERCOM           6             /* 6 SERCOM */
#  define SAMD2L2_NI2S              0             /* No I2S */
#  define SAMD2L2_NADC              15            /* 14 ADC channels */
#  define SAMD2L2_NCMP              2             /* 2 Comparators */
#  define SAMD2L2_NDAC              1             /* 1 DAC channel */
#  define SAMD2L2_NOPAMP            0             /* No OpAmps */
#  define SAMD2L2_RTC               1             /* Have RTC */
#  define SAMD2L2_NALARMS           1             /* 1 RTC alarm */
#  define SAMD2L2_NRTCMP            1             /* RTC compare: 1 32-bit/2 16-bit */
#  define SAMD2L2_NEXTINT           16            /* 16 External interrupts */
#  define SAMD2L2_NPTCX             12            /* PTC X */
#  define SAMD2L2_NPTCY             10            /* PTC Y */
#  define SAMD2L2_WDT               1             /* Have watchdog timer */
#elif defined(SAMD20J)
#  define SAMD2L2_NEVENTS           8             /* 8 event channels */
#  define SAMD2L2_NTC               8             /* 8 Timer/counters */
#  define SAMD2L2_NTCOUT            2             /* 2 TC output channels */
#  define SAMD2L2_NTCC              0             /* No TC control channels */
#  define SAMD2L2_NTCCOUT           0             /* No TCC output channels */
#  define SAMD2L2_NDMACHAN          0             /* No DMA channels */
#  define SAMD2L2_NUSBIF            0             /* No USB interface */
#  define SAMD2L2_NAES              0             /* No AES engine */
#  define SAMD2L2_NCCL              0             /* No Counfigurable Custom Logic */
#  define SAMD2L2_NTRNG             0             /* No True random number generator */
#  define SAMD2L2_NSERCOM           6             /* 6 SERCOM */
#  define SAMD2L2_NI2S              0             /* No I2S */
#  define SAMD2L2_NADC              20            /* 20 ADC channels */
#  define SAMD2L2_NCMP              2             /* 2 Comparators */
#  define SAMD2L2_NDAC              1             /* 1 DAC channel */
#  define SAMD2L2_NOPAMP              0             /* No OpAmps */
#  define SAMD2L2_RTC               1             /* Have RTC */
#  define SAMD2L2_NALARMS           1             /* 1 RTC alarm */
#  define SAMD2L2_NRTCMP            1             /* RTC compare: 1 32-bit/2 16-bit */
#  define SAMD2L2_NEXTINT           16            /* 16 External interrupts */
#  define SAMD2L2_NPTCX             16            /* PTC X */
#  define SAMD2L2_NPTCY             16            /* PTC Y */
#  define SAMD2L2_WDT               1             /* Have watchdog timer */
#endif

