apache/nuttx/arch/arm/include/samd2l2/chip.h
/* SAMD21 Family ********************************************************************/
/* FEATURE             SAM D21J          SAM D21G           SAM D21E
 * ------------------- ------------------ ------------------ --------
 * No. of pins         64                 48                 32
 * Flash               256/128/64/32/16KB 256/128/64/32KB    256/128/64/32KB
 * SRAM                32/16/8/4/2KB      32/16/8/4/2KB      32/16/8/4KB
 * Max. Freq.          48MHz              48MHz              48MHz
 * Event channels      12                 12                 12
 * Timer/counters      5                  3                  3
 * TC output channels  2                  2                  2
 * T/C Control         3                  3                  3
 * TCC output channels 2                  2                  2
 * TCC waveform output 8/4/2              8/4/2              6/4/2
 * DMA channels        12                 12                 12
 * USB interface       1                  1                  1
 * SERCOM              6                  6                  4
 * I2S                 1                  1                  1
 * ADC channels        20                 14                 10
 * Comparators         2                  2                  2
 * DAC channels        1                  1                  1
 * RTC                 Yes                Yes                Yes
 * RTC alarms          1                  1                  1
 * RTC compare         1 32-bit/2 16-bit  1 32-bit/2 16-bit  1 32-bit/2 16-bit
 * External interrupts 16                 16                 16
 * PTC X an Y          16x16              12x10              10x6
 * Packages            QFN/TQFP           QFN/TQFP/WLCSP     QFN/TQFP/UFBGA
 * Oscillators         XOSC32, XOSC, OSC32K, OSCULP32K, OSC8M, DFLL48M, and FDPLL96M
 * SW Debug interface  Yes                Yes                Yes
 * Watchdog timer      Yes                Yes                Yes
 */

#if defined(CONFIG_ARCH_CHIP_SAMD21E15A) || defined(CONFIG_ARCH_CHIP_SAMD21E15B)

#  define SAMD21                    1             /* SAMD21 family */
#  define SAMD21E                   1             /* SAMD21E */
#  undef  SAMD21G
#  undef  SAMD21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (32*1024)     /* 32KB */
#  define SAMD2L2_SRAM0_SIZE        (4*1024)      /* 4KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#  if defined(CONFIG_ARCH_CHIP_SAMD21E15A)
#    define SAMD2L2_FLASHRWW_SIZE   (0*1024)      /* None */
#  else
#    define SAMD2L2_FLASHRWW_SIZE   (1*1024)      /* 1KB */
#  endif

#elif defined(CONFIG_ARCH_CHIP_SAMD21E16A) || defined(CONFIG_ARCH_CHIP_SAMD21E16B)

#  define SAMD21                    1             /* SAMD21 family */
#  define SAMD21E                   1             /* SAMD21E */
#  undef  SAMD21G
#  undef  SAMD21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (64*1024)     /* 64KB */
#  define SAMD2L2_SRAM0_SIZE        (8*1024)      /* 8KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#  if defined(CONFIG_ARCH_CHIP_SAMD21E16A)
#    define SAMD2L2_FLASHRWW_SIZE   (0*1024)      /* None */
#  else
#    define SAMD2L2_FLASHRWW_SIZE   (2*1024)      /* 2KB */
#  endif

#elif defined(CONFIG_ARCH_CHIP_SAMD21E17A)

#  define SAMD21                    1             /* SAMD21 family */
#  define SAMD21E                   1             /* SAMD21E */
#  undef  SAMD21G
#  undef  SAMD21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (128*1024)    /* 128KB */
#  define SAMD2L2_FLASHRWW_SIZE     (0*1024)      /* None */
#  define SAMD2L2_SRAM0_SIZE        (16*1024)     /* 16KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD21E18A)

#  define SAMD21                    1             /* SAMD21 family */
#  define SAMD21E                   1             /* SAMD21E */
#  undef  SAMD21G
#  undef  SAMD21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (256*1024)    /* 256KB */
#  define SAMD2L2_FLASHRWW_SIZE     (0*1024)      /* None */
#  define SAMD2L2_SRAM0_SIZE        (32*1024)     /* 32KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD21G15A) || defined(CONFIG_ARCH_CHIP_SAMD21G15B)

#  define SAMD21                    1             /* SAMD21 family */
#  undef  SAMD21E
#  define SAMD21G                   1             /* SAMD21G */
#  undef  SAMD21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (32*1024)     /* 32KB */
#  define SAMD2L2_SRAM0_SIZE        (4*1024)      /* 4KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#  if defined(CONFIG_ARCH_CHIP_SAMD21G15A)
#    define SAMD2L2_FLASHRWW_SIZE   (0*1024)      /* None */
#  else
#    define SAMD2L2_FLASHRWW_SIZE   (1*1024)      /* 1KB */
#  endif

#elif defined(CONFIG_ARCH_CHIP_SAMD21G16A) || defined(CONFIG_ARCH_CHIP_SAMD21G16B)

#  define SAMD21                    1             /* SAMD21 family */
#  undef  SAMD21E
#  define SAMD21G                   1             /* SAMD21G */
#  undef  SAMD21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (64*1024)     /* 64KB */
#  define SAMD2L2_SRAM0_SIZE        (8*1024)      /* 8KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#  if defined(CONFIG_ARCH_CHIP_SAMD21G16A)
#    define SAMD2L2_FLASHRWW_SIZE   (0*1024)      /* None */
#  else
#    define SAMD2L2_FLASHRWW_SIZE   (2*1024)      /* 2KB */
#  endif

#elif defined(CONFIG_ARCH_CHIP_SAMD21G17A)

#  define SAMD21                    1             /* SAMD21 family */
#  undef  SAMD21E
#  define SAMD21G                   1             /* SAMD21G */
#  undef  SAMD21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (128*1024)    /* 128KB */
#  define SAMD2L2_FLASHRWW_SIZE     (0*1024)      /* None */
#  define SAMD2L2_SRAM0_SIZE        (16*1024)     /* 16KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD21G18A)

#  define SAMD21                    1             /* SAMD21 family */
#  undef  SAMD21E
#  define SAMD21G                   1             /* SAMD21G */
#  undef  SAMD21J

/* Internal memory */

