apache/nuttx/arch/arm/include/samd2l2/chip.h
#  define SAMD2L2_FLASH_SIZE        (256*1024)    /* 256KB */
#  define SAMD2L2_FLASHRWW_SIZE     (0*1024)      /* None */
#  define SAMD2L2_SRAM0_SIZE        (32*1024)     /* 32KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD21J15A) || defined(CONFIG_ARCH_CHIP_SAMD21J15B)

#  define SAMD21                    1             /* SAMD21 family */
#  undef  SAMD21E
#  undef  SAMD21G
#  define SAMD21J                   1             /* SAMD21J */

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (32*1024)     /* 32KB */
#  define SAMD2L2_SRAM0_SIZE        (4*1024)      /* 4KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#  if defined(CONFIG_ARCH_CHIP_SAMD21J15A)
#    define SAMD2L2_FLASHRWW_SIZE   (0*1024)      /* None */
#  else
#    define SAMD2L2_FLASHRWW_SIZE   (1*1024)      /* 1KB */
#  endif

#elif defined(CONFIG_ARCH_CHIP_SAMD21J16A) || defined(CONFIG_ARCH_CHIP_SAMD21J16B)

#  define SAMD21                    1             /* SAMD21 family */
#  undef  SAMD21E
#  undef  SAMD21G
#  define SAMD21J                   1             /* SAMD21J */

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (64*1024)     /* 64KB */
#  define SAMD2L2_SRAM0_SIZE        (8*1024)      /* 8KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#  if defined(CONFIG_ARCH_CHIP_SAMD21J16A)
#    define SAMD2L2_FLASHRWW_SIZE   (0*1024)      /* None */
#  else
#    define SAMD2L2_FLASHRWW_SIZE   (2*1024)      /* 2KB */
#  endif

#elif defined(CONFIG_ARCH_CHIP_SAMD21J17A)

#  define SAMD21                    1             /* SAMD21 family */
#  undef  SAMD21E
#  undef  SAMD21G
#  define SAMD21J                   1             /* SAMD21J */

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (128*1024)    /* 128KB */
#  define SAMD2L2_FLASHRWW_SIZE     (0*1024)      /* None */
#  define SAMD2L2_SRAM0_SIZE        (16*1024)     /* 16KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#elif defined(CONFIG_ARCH_CHIP_SAMD21J18A)

#  define SAMD21                    1             /* SAMD21 family */
#  undef  SAMD21E
#  undef  SAMD21G
#  define SAMD21J                   1             /* SAMD21J */

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (256*1024)    /* 256KB */
#  define SAMD2L2_FLASHRWW_SIZE     (0*1024)      /* None */
#  define SAMD2L2_SRAM0_SIZE        (32*1024)     /* 32KB */
#  define SAMD2L2_LPRAM_SIZE        (0*1024)      /* None */

#else

#  undef  SAMD21                                  /* Not SAMD21 family */
#  undef  SAMD21E
#  undef  SAMD21G
#  undef  SAMD21J

#endif

#if defined(SAMD21E)
#  define SAMD2L2_NEVENTS           12            /* 12 event channels */
#  define SAMD2L2_NTC               3             /* 3 Timer/counters */
#  define SAMD2L2_NTCOUT            2             /* 2 TC output channels */
#  define SAMD2L2_NTCC              3             /* 3 TC control channels */
#  define SAMD2L2_NTCCOUT           2             /* 2 TCC output channels */
#  define SAMD2L2_TCC_NWAVEFORMS    8             /* Each TCC has a different number of outputs */
#  define SAMD2L2_NDMACHAN          12            /* 12 DMA channels */
#  define SAMD2L2_NUSBIF            1             /* 1 USB interface */
#  define SAMD2L2_NAES              1             /* 1 AES engine */
#  define SAMD2L2_NCCL              4             /* 4 Counfigurable Custom Logic */
#  define SAMD2L2_NTRNG             1             /* 1 True random number generator */
#  define SAMD2L2_NSERCOM           4             /* 4 SERCOM */
#  define SAMD2L2_NI2S              1             /* 1 I2S */
#  define SAMD2L2_NADC              10            /* 10 ADC channels */
#  define SAMD2L2_NCMP              2             /* 2 Comparators */
#  define SAMD2L2_NDAC              1             /* 1 DAC channel */
#  define SAMD2L2_NOPAMP            3             /* 3 OpAmps */
#  define SAMD2L2_RTC               1             /* Have RTC */
#  define SAMD2L2_NALARMS           1             /* 1 RTC alarm */
#  define SAMD2L2_NRTCMP            1             /* RTC compare: 1 32-bit/2 16-bit */
#  define SAMD2L2_NEXTINT           16            /* 16 External interrupts */
#  define SAMD2L2_NPTCX             10            /* 10x6 */
#  define SAMD2L2_NPTCY             6             /* 10x6*/
#  define SAMD2L2_WDT               1             /* Have watchdog timer */
#elif defined(SAMD21G)
#  define SAMD2L2_NEVENTS           12            /* 12 event channels */
#  define SAMD2L2_NTC               3             /* 3 Timer/counters */
#  define SAMD2L2_NTCOUT            2             /* 2 TC output channels */
#  define SAMD2L2_NTCC              3             /* 3 TC control channels */
#  define SAMD2L2_NTCCOUT           2             /* 2 TCC output channels */
#  define SAMD2L2_TCC_NWAVEFORMS    8             /* Each TCC has a different number of outputs */
#  define SAMD2L2_NDMACHAN          12            /* 12 DMA channels */
#  define SAMD2L2_NUSBIF            1             /* 1 USB interface */
#  define SAMD2L2_NAES              1             /* 1 AES engine */
#  define SAMD2L2_NCCL              4             /* 4 Counfigurable Custom Logic */
#  define SAMD2L2_NTRNG             1             /* 1 True random number generator */
#  define SAMD2L2_NSERCOM           6             /* 6 SERCOM */
#  define SAMD2L2_NI2S              1             /* 1 I2S */
#  define SAMD2L2_NADC              14            /* 14 ADC channels */
#  define SAMD2L2_NCMP              2             /* 2 Comparators */
#  define SAMD2L2_NDAC              1             /* 1 DAC channel */
#  define SAMD2L2_NOPAMP            3             /* 3 OpAmps */
#  define SAMD2L2_RTC               1             /* Have RTC */
#  define SAMD2L2_NALARMS           1             /* 1 RTC alarm */
#  define SAMD2L2_NRTCMP            1             /* RTC compare: 1 32-bit/2 16-bit */
#  define SAMD2L2_NEXTINT           16            /* 16 External interrupts */
#  define SAMD2L2_NPTCX             12            /* 12x10 */
#  define SAMD2L2_NPTCY             10            /* 12x10 */
#  define SAMD2L2_WDT               1             /* Have watchdog timer */
#elif defined(SAMD21J)
#  define SAMD2L2_NEVENTS           12            /* 12 event channels */
#  define SAMD2L2_NTC               5             /* 5 Timer/counters */
#  define SAMD2L2_NTCOUT            2             /* 2 TC output channels */
#  define SAMD2L2_NTCC              3             /* 3 TC control channels */
#  define SAMD2L2_NTCCOUT           2             /* 2 TCC output channels */
#  define SAMD2L2_TCC_NWAVEFORMS    8             /* Each TCC has a different number of outputs */
#  define SAMD2L2_NDMACHAN          12            /* 12 DMA channels */
#  define SAMD2L2_NUSBIF            1             /* 1 USB interface */
#  define SAMD2L2_NAES              1             /* 1 AES engine */
#  define SAMD2L2_NCCL              4             /* 4 Counfigurable Custom Logic */
#  define SAMD2L2_NTRNG             1             /* 1 True random number generator */
#  define SAMD2L2_NSERCOM           6             /* 6 SERCOM */
#  define SAMD2L2_NI2S              1             /* 1 I2S */
#  define SAMD2L2_NADC              20            /* 20 ADC channels */
#  define SAMD2L2_NCMP              2             /* 2 Comparators */
#  define SAMD2L2_NDAC              1             /* 1 DAC channel */
#  define SAMD2L2_NOPAMP              3             /* 3 OpAmps */
#  define SAMD2L2_RTC               1             /* Have RTC */
#  define SAMD2L2_NALARMS           1             /* 1 RTC alarm */
#  define SAMD2L2_NRTCMP            1             /* RTC compare: 1 32-bit/2 16-bit */
#  define SAMD2L2_NEXTINT           16            /* 16 External interrupts */
#  define SAMD2L2_NPTCX             16            /* 16x16 */
#  define SAMD2L2_NPTCY             16            /* 16x16*/
#  define SAMD2L2_WDT               1             /* Have watchdog timer */
#endif

