apache/nuttx/arch/arm/include/samd2l2/chip.h
/* SAML21 Family ********************************************************************/
/* FEATURE             SAM L21J          SAM L21G           SAM L21E
 * ------------------- ------------------ ------------------ --------
 * No. of pins         64                 48                 32
 * Flash               256/128/64KB       256/128/64KB       256/128/64/32KB
 * Flash RWW           8/4/2KB            8/4/2KB            8/4/2/1KB
 * SRAM                32/16/8KB          32/16/8KB          32/16/8/4KB
 * Max. Freq.          48MHz              48MHz              48MHz
 * Event channels      12                 12                 12
 * Timer/counters      5                  3                  3
 * TC output channels  2                  2                  2
 * T/C Control         3                  3                  3
 * TCC output channels 2                  2                  2
 * TCC waveform output 8/4/2              8/4/2              6/4/2
 * DMA channels        16                 16                 16
 * USB interface       1                  1                  1
 * AES engine          1                  1                  1
 * CCLs                4                  4                  4
 * TRNG                1                  1                  1
 * SERCOM              6                  6                  4
 * ADC channels        20                 14                 10
 * Comparators         2                  2                  2
 * DAC channels        2                  2                  2
 * OPAMP               3                  3                  3
 * RTC                 Yes                Yes                Yes
 * RTC alarms          1                  1                  1
 * RTC compare         1 32-bit/2 16-bit  1 32-bit/2 16-bit  1 32-bit/2 16-bit
 * External interrupts 16                 16                 16
 * PTC X an Y          12x16              8x12               6x10
 *                     16x12              12x8               10x6
 * Packages            QFN/TQFP           QFN/TQFP           QFN/TQFP
 * Oscillators         XOSC32, XOSC, OSC32K, OSCULP32K, OSC16M, DFLL48M, and FDPLL96M
 * SW Debug interface  Yes                Yes                Yes
 * Watchdog timer      Yes                Yes                Yes
 */

#if defined(CONFIG_ARCH_CHIP_SAML21E15)

#  define SAML21                    1             /* SAML21 family */
#  define SAML21E                   1             /* SAML21E */
#  undef  SAML21G
#  undef  SAML21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (32*1024)     /* 32KB */
#  define SAMD2L2_FLASHRWW_SIZE     (1*1024)      /*  1KB */
#  define SAMD2L2_SRAM0_SIZE        (4*1024)      /*  4KB */
#  define SAMD2L2_LPRAM_SIZE        (2*1024)      /*  2KB */

/* TCC waveform outputs */

#  define SAMD2L2_TCC_NWAVEFORMS    2             /* 2 TCC waveform outputs */

#elif defined(CONFIG_ARCH_CHIP_SAML21E16)

#  define SAML21                    1             /* SAML21 family */
#  define SAML21E                   1             /* SAML21E */
#  undef  SAML21G
#  undef  SAML21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (64*1024)     /* 64KB */
#  define SAMD2L2_FLASHRWW_SIZE     (2*1024)      /*  2KB */
#  define SAMD2L2_SRAM0_SIZE        (8*1024)      /*  8KB */
#  define SAMD2L2_LPRAM_SIZE        (4*1024)      /*  4KB */

/* TCC waveform outputs */

#  define SAMD2L2_TCC_NWAVEFORMS    2             /* 2 TCC waveform outputs */

#elif defined(CONFIG_ARCH_CHIP_SAML21E17)

#  define SAML21                    1             /* SAML21 family */
#  define SAML21E                   1             /* SAML21E */
#  undef  SAML21G
#  undef  SAML21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (128*1024)    /* 128KB */
#  define SAMD2L2_FLASHRWW_SIZE     (4*1024)      /*   4KB */
#  define SAMD2L2_SRAM0_SIZE        (16*1024)     /*  16KB */
#  define SAMD2L2_LPRAM_SIZE        (8*1024)      /*   8KB */

/* TCC waveform outputs */

#  define SAMD2L2_TCC_NWAVEFORMS    4             /* 4 TCC waveform outputs */

#elif defined(CONFIG_ARCH_CHIP_SAML21E18)

#  define SAML21                    1             /* SAML21 family */
#  define SAML21E                   1             /* SAML21E */
#  undef  SAML21G
#  undef  SAML21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (256*1024)    /* 256KB */
#  define SAMD2L2_FLASHRWW_SIZE     (8*1024)      /*   8KB */
#  define SAMD2L2_SRAM0_SIZE        (32*1024)     /*  32KB */
#  define SAMD2L2_LPRAM_SIZE        (8*1024)      /*   8KB */

/* TCC waveform outputs */

#  define SAMD2L2_TCC_NWAVEFORMS    6             /* 6 TCC waveform outputs */

#elif defined(CONFIG_ARCH_CHIP_SAML21G16)

#  define SAML21                    1             /* SAML21 family */
#  undef  SAML21E
#  define SAML21G                   1             /* SAML21G */
#  undef  SAML21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (64*1024)     /* 64KB */
#  define SAMD2L2_FLASHRWW_SIZE     (2*1024)      /*  2KB */
#  define SAMD2L2_SRAM0_SIZE        (8*1024)      /*  8KB */
#  define SAMD2L2_LPRAM_SIZE        (4*1024)      /*  4KB */

/* TCC waveform outputs */

#  define SAMD2L2_TCC_NWAVEFORMS    2             /* 2 TCC waveform outputs */

#elif defined(CONFIG_ARCH_CHIP_SAML21G17)

#  define SAML21                    1             /* SAML21 family */
#  undef  SAML21E
#  define SAML21G                   1             /* SAML21G */
#  undef  SAML21J

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (128*1024)    /* 128KB */
#  define SAMD2L2_FLASHRWW_SIZE     (4*1024)      /*   4KB */
#  define SAMD2L2_SRAM0_SIZE        (16*1024)     /*  16KB */
#  define SAMD2L2_LPRAM_SIZE        (8*1024)      /*   8KB */

/* TCC waveform outputs */

#  define SAMD2L2_TCC_NWAVEFORMS    4              /* 4 TCC waveform outputs */

#elif defined(CONFIG_ARCH_CHIP_SAML21G18)

#  define SAML21                    1             /* SAML21 family */
#  undef  SAML21E
#  define SAML21G                   1             /* SAML21G */
#  undef  SAML21J

/* Internal memory */

