apache/nuttx/arch/arm/include/samd2l2/chip.h
#  define SAMD2L2_FLASH_SIZE        (256*1024)    /* 256KB */
#  define SAMD2L2_FLASHRWW_SIZE     (8*1024)      /*   8KB */
#  define SAMD2L2_SRAM0_SIZE        (32*1024)     /*  32KB */
#  define SAMD2L2_LPRAM_SIZE        (8*1024)      /*   8KB */

/* TCC waveform outputs */

#  define SAMD2L2_TCC_NWAVEFORMS    8              /* 8 TCC waveform outputs */

#elif defined(CONFIG_ARCH_CHIP_SAML21J16)

#  define SAML21                    1             /* SAML21 family */
#  undef  SAML21E
#  undef  SAML21G
#  define SAML21J                   1             /* SAML21J */

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (64*1024)     /* 64KB */
#  define SAMD2L2_FLASHRWW_SIZE     (2*1024)      /*  2KB */
#  define SAMD2L2_SRAM0_SIZE        (8*1024)      /*  8KB */
#  define SAMD2L2_LPRAM_SIZE        (8*1024)      /*  4KB */

/* TCC waveform outputs */

#  define SAMD2L2_TCC_NWAVEFORMS    2             /* 2 TCC waveform outputs */

#elif defined(CONFIG_ARCH_CHIP_SAML21J17)

#  define SAML21                    1             /* SAML21 family */
#  undef  SAML21E
#  undef  SAML21G
#  define SAML21J                   1             /* SAML21J */

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (128*1024)    /* 128KB */
#  define SAMD2L2_FLASHRWW_SIZE     (4*1024)      /*   4KB */
#  define SAMD2L2_SRAM0_SIZE        (16*1024)     /*  16KB */
#  define SAMD2L2_LPRAM_SIZE        (8*1024)      /*   8KB */

/* TCC waveform outputs */

#  define SAMD2L2_TCC_NWAVEFORMS    4             /* 4 TCC waveform outputs */

#elif defined(CONFIG_ARCH_CHIP_SAML21J18)

#  define SAML21                    1             /* SAML21 family */
#  undef  SAML21E
#  undef  SAML21G
#  define SAML21J                   1             /* SAML21J */

/* Internal memory */

#  define SAMD2L2_FLASH_SIZE        (256*1024)    /* 256KB */
#  define SAMD2L2_FLASHRWW_SIZE     (8*1024)      /*   8KB */
#  define SAMD2L2_SRAM0_SIZE        (32*1024)     /*  32KB */
#  define SAMD2L2_LPRAM_SIZE        (8*1024)      /*   8KB */

/* TCC waveform outputs */

#  define SAMD2L2_TCC_NWAVEFORMS    8             /* 8 TCC waveform outputs */

#else

#  undef  SAML21                                  /* Not SAML21 family */
#  undef  SAML21E
#  undef  SAML21G
#  undef  SAML21J

#endif

#if defined(SAML21E)
#  define SAMD2L2_NEVENTS           12            /* 12 event channels */
#  define SAMD2L2_NTC               3             /* 3 Timer/counters */
#  define SAMD2L2_NTCOUT            2             /* 2 TC output channels */
#  define SAMD2L2_NTCC              3             /* 3 TC control channels */
#  define SAMD2L2_NTCCOUT           2             /* 2 TCC output channels */
#  define SAMD2L2_NDMACHAN          16            /* 16 DMA channels */
#  define SAMD2L2_NUSBIF            1             /* 1 USB interface */
#  define SAMD2L2_NAES              1             /* 1 AES engine */
#  define SAMD2L2_NCCL              4             /* 4 Counfigurable Custom Logic */
#  define SAMD2L2_NTRNG             1             /* 1 True random number generator */
#  define SAMD2L2_NSERCOM           4             /* 4 SERCOM */
#  define SAMD2L2_NI2S              0             /* No I2S */
#  define SAMD2L2_NADC              10            /* 10 ADC channels */
#  define SAMD2L2_NCMP              2             /* 2 Comparators */
#  define SAMD2L2_NDAC              2             /* 2 DAC channels */
#  define SAMD2L2_NOPAMP            3             /* 3 OpAmps */
#  define SAMD2L2_RTC               1             /* Have RTC */
#  define SAMD2L2_NALARMS           1             /* 1 RTC alarm */
#  define SAMD2L2_NRTCMP            1             /* RTC compare: 1 32-bit/2 16-bit */
#  define SAMD2L2_NEXTINT           16            /* 16 External interrupts */
#  define SAMD2L2_NPTCX             10            /* PTC X 6 or 10 */
#  define SAMD2L2_NPTCY             10            /* PTC Y 6 or 10*/
#  define SAMD2L2_WDT               1             /* Have watchdog timer */
#elif defined(SAML21G)
#  define SAMD2L2_NEVENTS           12            /* 12 event channels */
#  define SAMD2L2_NTC               3             /* 3 Timer/counters */
#  define SAMD2L2_NTCOUT            2             /* 2 TC output channels */
#  define SAMD2L2_NTCC              3             /* 3 TC control channels */
#  define SAMD2L2_NTCCOUT           2             /* 2 TCC output channels */
#  define SAMD2L2_NDMACHAN          16            /* 16 DMA channels */
#  define SAMD2L2_NUSBIF            1             /* 1 USB interface */
#  define SAMD2L2_NAES              1             /* 1 AES engine */
#  define SAMD2L2_NCCL              4             /* 4 Counfigurable Custom Logic */
#  define SAMD2L2_NTRNG             1             /* 1 True random number generator */
#  define SAMD2L2_NSERCOM           6             /* 6 SERCOM */
#  define SAMD2L2_NI2S              0             /* No I2S */
#  define SAMD2L2_NADC              14            /* 14 ADC channels */
#  define SAMD2L2_NCMP              2             /* 2 Comparators */
#  define SAMD2L2_NDAC              2             /* 2 DAC channels */
#  define SAMD2L2_NOPAMP            3             /* 3 OpAmps */
#  define SAMD2L2_RTC               1             /* Have RTC */
#  define SAMD2L2_NALARMS           1             /* 1 RTC alarm */
#  define SAMD2L2_NRTCMP            1             /* RTC compare: 1 32-bit/2 16-bit */
#  define SAMD2L2_NEXTINT           16            /* 16 External interrupts */
#  define SAMD2L2_NPTCX             12            /* PTC X 8 or 12 */
#  define SAMD2L2_NPTCY             12            /* PTC Y 8 or 12*/
#  define SAMD2L2_WDT               1             /* Have watchdog timer */
#elif defined(SAML21J)
#  define SAMD2L2_NEVENTS           12            /* 12 event channels */
#  define SAMD2L2_NTC               5             /* 5 Timer/counters */
#  define SAMD2L2_NTCOUT            2             /* 2 TC output channels */
#  define SAMD2L2_NTCC              3             /* 3 TC control channels */
#  define SAMD2L2_NTCCOUT           2             /* 2 TCC output channels */
#  define SAMD2L2_NDMACHAN          16            /* 16 DMA channels */
#  define SAMD2L2_NUSBIF            1             /* 1 USB interface */
#  define SAMD2L2_NAES              1             /* 1 AES engine */
#  define SAMD2L2_NCCL              4             /* 4 Counfigurable Custom Logic */
#  define SAMD2L2_NTRNG             1             /* 1 True random number generator */
#  define SAMD2L2_NSERCOM           6             /* 6 SERCOM */
#  define SAMD2L2_NI2S              0             /* No I2S */
#  define SAMD2L2_NADC              20            /* 20 ADC channels */
#  define SAMD2L2_NCMP              2             /* 2 Comparators */
#  define SAMD2L2_NDAC              2             /* 2 DAC channels */
#  define SAMD2L2_NOPAMP            3             /* 3 OpAmps */
#  define SAMD2L2_RTC               1             /* Have RTC */
#  define SAMD2L2_NALARMS           1             /* 1 RTC alarm */
#  define SAMD2L2_NRTCMP            1             /* RTC compare: 1 32-bit/2 16-bit */
#  define SAMD2L2_NEXTINT           16            /* 16 External interrupts */
#  define SAMD2L2_NPTCX             16            /* PTC X 12 or 16 */
#  define SAMD2L2_NPTCY             16            /* PTC Y 12 or 16*/
#  define SAMD2L2_WDT               1             /* Have watchdog timer */
#endif

/* NVIC priority levels *************************************************************/
/* Each priority field holds a priority value, 0-3. The lower the value, the greater
 * the priority of the corresponding interrupt. The processor implements only
 * bits[7:6] of each field, bits[5:0] read as zero and ignore writes.
 */

#define NVIC_SYSH_PRIORITY_MIN      0xc0 /* All bits[7:6] set is minimum priority */
#define NVIC_SYSH_PRIORITY_DEFAULT  0x80 /* Midpoint is the default */
#define NVIC_SYSH_PRIORITY_MAX      0x00 /* Zero is maximum priority */
#define NVIC_SYSH_PRIORITY_STEP     0x40 /* Five bits of interrupt priority used */

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Functions
 ************************************************************************************/

#endif /* __ARCH_ARM_INCLUDE_SAMD2L2_CHIP_H */
